s = ""
str1 = "hello world"
str2 = "python"
print("----------------------------------------------------------------")
print(s, str1, str2)

print("----------------------------------------------------------------")
print(type(s), type(str1), type(str2))

print("----------------------------------------------------------------")
print(isinstance(str1, str), isinstance(str2, str))

print("----------------------------------------------------------------")
print(type(str1) == str)


print("----------------------------------------------------------------")
str3 = "나는 '정우성'입니다."     # 작은따옴표 사용
print(str3)
str3 = "나는 \"정우성\"입니다." # 이스케이프문자 사용
print(str3)
#따옴표를 사용하고싶으면 내부에는 다른 종류의 따옴표를 사용하거나 \를 사용해서 표현한다.
print("----------------------------------------------------------------")
s01 = "aaa"
s02 = "aaa"

print(id(s01))
print(id(s02))
